Repository: MovalysMDK/mdk-cli-templates
Catalog: ios/MFTemplate/resources/strings/*.lproj/Localizable-framework.strings
Languages: fr

# MFUnhandledExceptionTitle
source: Unhandled exception
fr: Erreur inconnue

# MFUnhandledExceptionMessage
source: Exception ... %@ %@
fr: Erreur ... %@ %@

# MFUnhandledExceptionQuitButton
source: Quit
fr: Quitter

# MFUnhandledExceptionSendLogButton
source: Send Log
fr: Erreur lors de l'envoi de log

# MFCSSConflictExceptionTitle
source: CSS conflict exception
fr: Erreur : conflit CSS

# MFCSSConflictExceptionMessage
source: Two different CSS stylesheets ("%@","%@") are given for the controller %@. You must specify only one custom CSS stylesheet by ViewController
fr: Deux feuilles de style CSS différentes ("%@","%@") sont spécifiées pour le contrôleur %@. Vous devez spécifier une seule feuille de style personnalisée par contrôleur.

# MFTooShortStringUIValidationError
source: Too short value
fr: Valeur trop petite

# MFTooLongStringUIValidationError
source: Too long value
fr: Valeur trop grande

# MFMandatoryFieldUIValidationError
source: Mandatory field
fr: Champ obligatoire

# MFNoMatchingValueUIValidationError
source: No matching value found
fr: Aucune valeur trouvée

# MFInvalidEmailValueUIValidationError
source: The value isn't a valid email address
fr: La saisie n'est pas une adresse e-mail valide

# MFInvalidUrlValueUIValidationError
source: The value isn't a valid URL
fr: La saisie n'est pas une URL valide

# MFInvalidPhoneNumberValueUIValidationError
source: The value isn't a valid phone number
fr: La saisie n'est pas un numéro de téléphone valide

# MFInvalidDoubleValueUIValidationError
source: The value isn't a valid double number
fr: La saisie n'est pas un nombre décimal valide

# MFInvalidIntegerValueUIValidationError
source: The value isn't a valid integer number
fr: La saisie n'est pas un nombre entier valide

# MFInvalidLocationValueUIValidationError
source: The latitude or longitude value is not valid
fr: La latitude ou la longitude n'est pas correcte

# MFCantSendMailTechnicalError
source: This device can't send mail
fr: Cet appareil ne peut pas envoyer d'e-mail

# closeButton
source: Close
fr: Fermer

# MFPickerListCancelButtonTitle
source: Cancel
fr: Annuler

# MFPickerList_noData_title
source: No data
fr: Aucune donnée

# MFPickerList_noData_message
source: This component can not be displayed because it does not have any data
fr: Ce composant ne peut être affiché car il n'a pas de donnée.

# DebugLogEmailHTMLBody
source: Email for debugging application named %@
fr: E-mail de débuggage de l'application %@

# DebugLogEmailHTMLBodyWithNoAttachment
source: Email for debugging application named %@ : no log file available.
fr: E-mail de débuggage de l'application %@ : pas de fichier de log disponible.

# SendMailCancelledInfoTitle
source: Send Email Result
fr: Envoi de message

# SendMailCancelledInfoMessage
source: User cancellation
fr: Annulation par l'utilisateur

# SendMailSavedAlertTitle
source: Save Email Result
fr: Sauvegarde

# SendMailSavedAlertMessage
source: Email saved successfully
fr: Message sauvegardé avec succès

# SendMailSentAlertTitle
source: Send Email Result
fr: Envoi

# SendMailSentAlertMessage
source: Email sent successfully
fr: Message envoyé avec succès

# SendMailFailedAlertTitle
source: Send Email Result
fr: Envoi

# SendMailFailedAlertMessage
source: Email sending failed
fr: Echec de l'envoi du message

# SendMailDefaultAlertTitle
source: Send Email Result
fr: Envoi

# SendMailDefaultAlertMessage
source: Email didn't send
fr: Le message n'a pas été envoyé

# menu__action_MFImportDatabaseAction__label
source: Import database
fr: Import Base de données

# menu__action_MFExportDatabaseAction__label
source: Export database
fr: Export Base de données

# menu__action_MFResetDatabaseAction__label
source: Reset database
fr: Reset Base de données

# menu__action_MFExportLogsAction__label
source: Export logs
fr: Export des logs

# menu__action_MFEmailLogsAction__label
source: Email logs
fr: Envoi des logs par email

# MFEmailLogsActionSubject
source: Application Logs
fr: Logs de l'Application

# MFExportDatabaseAction_alertok_title
source: Database Export
fr: Export Base de données

# MFExportDatabaseAction_alertok_message
source: Database export succeeded
fr: Export Base de données réussi

# MFImportDatabaseAction_alertok_title
source: Database Import
fr: Import Base de données

# MFImportDatabaseAction_alertok_message
source: Database import succeeded
fr: Import Base de données réussi

# MFResetDatabaseAction_alertok_title
source: Reset database
fr: Reset Base de données

# MFResetDatabaseAction_alertok_message
source: Reset database succeeded
fr: Reset Base de données réussi

# error_nosettingsparameterized
source: Application is not parameterized in the settings. You must define settings before starting application.
fr: L'application n'est pas parametrée dans les réglages. Vous devez définir les réglages avant de démarrer l'application.

# form_back
source: Back
fr: Retour

# form_save
source: Save
fr: Enregistrer

# form_cancel
source: Cancel
fr: Annuler

# alert_discardchanges_title
source: Warning, modifications not saved
fr: Attention, les modifications ne sont pas enregistrées

# alert_discardchanges_message
source: Discard changes ?
fr: Perdre les changements ?

# alert_discardchanges_no
source: No
fr: Non

# alert_discardchanges_yes
source: Yes
fr: Oui

# alert_savechanges_title
source: Warning, modifications not saved
fr: Attention, les modifications ne sont pas enregistrées

# alert_savechanges_message
source: Do you want to save now ?
fr: Voulez-vous enregistrer les changements ?

# alert_savechanges_no
source: No
fr: Non

# alert_savechanges_yes
source: Yes
fr: Oui

# form_no_data
source: No data found
fr: Aucun résultat

# waiting.view.loading.data
source: Loading data
fr: Chargement des données

# waiting.view.saving.photo
source: Saving photo...
fr: Sauvegarde de la photo en cours...

# waiting.view.refreshing.list
source: Refreshing list
fr: Actualisation de la liste

# waiting.view.indeterminate
source: Please wait...
fr: Patientez svp...

# MFSignatureCancelButtonTitle
source: Cancel
fr: Annuler

# MFSignatureClearButtonTitle
source: Clear
fr: Effacer

# photoControllerDetailsTitle
source: Details
fr: Détails

# photoErrorAlertTitle
source: Error
fr: Erreur

# savingPhotoErrorAlertMessage
source: Save failed
fr: Impossible de sauvegarder la photo

# photoNoCameraErrorMessage
source: No camera found
fr: Aucun appareil photo trouvé

# photoThumbnail_title_label
source: Title
fr: Titre

# clearButton
source: Clear
fr: Effacer

source: enter text
fr: saisir un texte

source: enter number
fr: saisir un nombre

# mdk_navigate_to
source: Navigate to :
fr: Naviguer vers :

# MFPositionError
source: Error
fr: Erreur

# MFPositionErrorMessage
source: Unable to get your position
fr: Impossible de déterminer de votre position

# MFPositionLatitudePlaceholderRW
source: Enter a latitude
fr: Saisir une latitude

# MFPositionLongitudePlaceholderRW
source: Enter a longitude
fr: Saisir une longitude

# MFFormSearchViewController_title
source: Filter
fr: Filtre

# MFFormSearchViewController_leftButton_title
source: Cancel
fr: Annuler
